app/controllers/invoices_controller.rb

SELECT * FROM `invoices`
---
  def index
    @invoices = Invoice.all

SELECT * FROM `invoices` WHERE (`invoices`.`id` = 1)
---
  def show
    @invoice = Invoice.find(params[:id])

SELECT * FROM `invoices` WHERE (`invoices`.`id` = 1)
---
  def edit
    @invoice = Invoice.find(params[:id])

INSERT INTO `invoices` (`created_at`, `total`, `gram_amt`, `grams`, `wastage`, `name`, `updated_at`, `address`, `decimal`, `discount`) VALUES('2013-08-18 10:04:29', 30499.999999999996, 3000.0, 10.0, 2.0, 'new', '2013-08-18 10:04:29', 'tpt', NULL, 100.0)
---
  def create
    @invoice = Invoice.new(params[:invoice])

    respond_to do |format|
      if @invoice.save

SELECT * FROM `invoices` WHERE (`invoices`.`id` = 1)
UPDATE `invoices` SET `updated_at` = '2013-08-18 08:10:32', `name` = 'aa', `address` = 'a\r\nasa\r\ns' WHERE `id` = 1
---
  def update
    @invoice = Invoice.find(params[:id])

    respond_to do |format|
      if @invoice.update_attributes(params[:invoice])

SELECT * FROM `invoices` WHERE (`invoices`.`id` = 1)
DELETE FROM `invoices` WHERE `id` = 1
---
  def destroy
    @invoice = Invoice.find(params[:id])
    @invoice.destroy