app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `password_salt`, `password_hash`, `username`, `updated_at`) VALUES('2013-08-18 09:55:07', '$2a$10$Zx3jgU/1Dw7cyuecMbSd.u', '$2a$10$Zx3jgU/1Dw7cyuecMbSd.ue5Rp/gU2/H2bMenGYAPSFTcoZyK3dHe', 'aa', '2013-08-18 09:55:07')
---
  def create
    @user = User.new(params[:user])
    if @user.save